#ifndef DEFINE_H__20241101
#define DEFINE_H__20241101

#include <QByteArray>

#pragma pack(push, 1)

////////////////////////////////////////////////////////////////////////////////////////////////////
/// <summary>	DDR 头标区 数据结构. </summary>
///
/// <remarks>	Liruilong, 2024/11/1. </remarks>
////////////////////////////////////////////////////////////////////////////////////////////////////

struct DDRHeader
{
    char logLen[5];   // 1.记录长度 5
    char transLever;  // 2.交换级别 1
    char headerTag;   // 3. 头标区标识符 1
    char codeTag;     // 4. 代码拓展指令符 1
    char version;     // 5. 版本号 1
    char indicator;   // 6. 应用指示器 1
    char ctrlLen[2];  // 7. 字段控制长度 2
    char address[5];  // 8. 字段区基地址 5
    char addTag[3];   // 9. 扩充字符集指示符 3
    char lenSize;     // 10. 字段长度字段大小 1
    char posSize;     // 11. 字段位置字段的大小 1
    char reservation; // 12. 保留 1
    char tagSIZE;     // 13. 字段标识段大小 1
};

////////////////////////////////////////////////////////////////////////////////////////////////////
/// <summary>	DDR目次区数据结构. </summary>
///
/// <remarks>	Liruilong, 2024/11/1. </remarks>
////////////////////////////////////////////////////////////////////////////////////////////////////

struct DDRPurpose
{
    // purposeData的长度length为 4 + DDRHeader中10所记录的长度+DDRHeader中11所记录的长度（DDRHeader结构解析出来后才能确认）
    // 当发现结束标识符 “▽”（ASCII第31个）时结束 ，如果下面六个字节是 “0000;&”（可能是其它，4个数字+“;&”）
    // 则结束目次区的记录（结束记录时也需记录当前的“▽”,不记录上诉6个字节）
    QByteArray purposeData;
};

////////////////////////////////////////////////////////////////////////////////////////////////////
/// <summary>	DDR 字段区. </summary>
///
/// <remarks>	Liruilong, 2024/11/1. </remarks>
////////////////////////////////////////////////////////////////////////////////////////////////////

struct DDRField
{
    // 当ddr目次区的数据结束后，如果接下来六个字节是“0000;&”（可能是其它，4个数字+“;&”）
    // 则开始记录fieldData（同时把这六个字节插入到fieldData中，最前面），直到出现“▽”（同时把“▽”插入到fieldData中）
    // 如果后面连着还有 六个字节（4个数字+“;&”），则开始下一条记录，否则停止记录，关闭文件
    QByteArray fieldData;
};

////////////////////////////////////////////////////////////////////////////////////////////////////
/// <summary>	整个文件的ddr数据. </summary>
///
/// <remarks>	Liruilong, 2024/11/1. </remarks>
////////////////////////////////////////////////////////////////////////////////////////////////////

struct DDRData
{
    DDRHeader               header;   // 头标区数据，只有一条
    std::vector<DDRPurpose> purposes; // 目次区数据，含有多条
    std::vector<DDRField>   fields;   // 字段区数据，含有多条
};

#pragma pack(pop, 1)
#endif
